Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་མངོན་པར་ཤེས་པ་རྣམས་ལ་ཡོངས་སུ་སྤྱོད་པ་མེད་དོ།
en: They do not indulge in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers.

source: །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་ཡོངས་སུ་སྤྱོད་པ་མེད་དོ།
en: They do not indulge in the meditative stabilities or the dhāraṇī gateways.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་ཡོངས་སུ་སྤྱོད་པ་མེད་དོ།
en: They do not indulge in the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, or the eighteen distinct qualities of the buddhas.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་ཡོངས་སུ་སྤྱོད་པ་མེད་དོ།
en: They do not indulge in [the goals], up to and including all-aspect omniscience.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་ཆོས་ཐམས་ཅད་ལ་ཡོངས་སུ་སྤྱོད་པ་མེད་དེ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་རྣམས་ཀྱི་མཚན་ཉིད་རབ་ཏུ་རྟོགས་པ་ཡིན་ནོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་དྲུག་ཅུ་དགུ་པ།
en: It is in this way, Subhūti, that bodhisattva great beings realize the defining characteristic of phenomena, of which all phenomena partake.” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་སྤྲུལ་པས་ལམ་བསྒོམ་པ་ལ་བརྟེན་ཀྱང་། ཀུན་ནས་ཉོན་མོངས་པར་ཡང་མི་འགྱུར་རྣམ་པར་བྱང་བར་ཡང་མི་འགྱུར་ལ། འགྲོ་བ་ལྔའི་འཁོར་བ་ན་ཡང་མི་གདའ་ན་ལམ་བསྒོམ་དུ་ཅི་མཆིས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, what is the cultivation of the path on which the Blessed One depends, without resorting either to affliction or purification, and which does not lapse into cyclic existence with its five classes of living beings?” “

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པ་དངོས་པོ་ལ་ལ་ཞིག་ལ་བརྟེན་ཏེ། ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བ་འམ། རྣམ་པར་བྱང་བར་འགྱུར་བ་འམ། འགྲོ་བ་ལྔའི་འཁོར་བ་ན་སྣང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་དངོས་པོ་གང་ཡང་ཡོད་དམ།
en: Subhūti,” asked the Blessed One in return, “do you think there is any such entity dependent on which an emanation of the tathāgatas will resort either to affliction or to purification, and which will appear within cyclic existence with its five classes of living beings?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་ཏེ།
en: No, Blessed Lord!

source: བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པའི་སྤྲུལ་པས་དངོས་པོ་ལ་ལ་ཞིག་ལ་རྟེན་ཏེ། ཀུན་ནས་ཉོན་མོངས་པར་འགྱུར་བ་འམ། རྣམ་པར་བྱང་བར་འགྱུར་བ་འམ། འགྲོ་བ་ལྔའི་འཁོར་བ་ན་གདའ་བར་འགྱུར་བའི་དངོས་པོ་དེ་ལྟ་བུ་གང་ཡང་མ་མཆིས་སོ།
en: There is no such entity dependent on which an emanation of the tathāgatas will resort either to affliction or to purification, and which will appear within cyclic existence with its five classes of living beings.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་རྣམས་ཀྱི་ཆོས་ཀྱི་ཚུལ་རབ་ཏུ་རྟོགས་པ་ཡིན་ནོ།
en: It is in this manner, Subhūti,” said the Blessed One, “that bodhisattva great beings realize the principle of phenomena, of which all phenomena partake.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། གཟུགས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུ་ལགས་སམ།
en: Blessed Lord, are all physical forms like a phantom emanation?

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུ་ལགས་སམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Are feelings, perceptions, formative predispositions, and consciousness like a phantom emanation?” “

source: རབ་འབྱོར་གཟུགས་ཐམས་ཅད་ནི་སྤྲུལ་པ་ལྟ་བུའོ། །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཐམས་ཅད་ནི་སྤྲུལ་པ་ལྟ་བུའོ། །གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ལྟར་གཟུགས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུ།
en: Subhūti,” replied the Blessed One, “all physical forms are like a phantom emanation.

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུ་ལགས་ན།
en: All feelings, perceptions, formative predispositions, and consciousness are like a phantom emanation.” “

source: བཅོམ་ལྡན་འདས་སྤྲུལ་པ་ལ་ནི་གཟུགས་མ་མཆིས། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་རྣམ་པར་ཤེས་པ་མ་མཆིས། ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས། རྣམ་པར་བྱང་བ་མ་མཆིས་པ་གང་ལས་འགྲོལ་བར་འགྱུར་བའི་འགྲོ་བ་ལྔའི་འཁོར་བ་མ་མཆིས་ན། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་མཐུར་འགྱུར།
en: Blessed Lord, if all physical forms are like a phantom emanation, and all feelings, perceptions, formative predispositions, and consciousness are like a phantom emanation, how then do bodhisattva great beings act effectively when phantom emanations are without physical forms; without feelings, perceptions, formative predispositions, and consciousness; and without either affliction or purification, so that they are without cyclic existence with its five classes of living beings?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པའི་ཚེ།
en: Subhūti,” asked the Blessed One in return, “when bodhisattva great beings engage in the conduct of a bodhisattva, do you think that {Ki.

source: སེམས་ཅན་དམྱལ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་སམ། གཤིན་རྗེའི་འཇིག་རྟེན་ནམ། ལྷ་འམ། མི་དག་ལས་ཡོངས་སུ་གྲོལ་བར་བྱ་བའི་སེམས་ཅན་གང་ཡང་དམིགས་སམ།
en: VIII: 76} they apprehend any being whom they should liberate from the hell realms, the animal realm, the world of Yama, or from among the gods and human beings?” “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཁམས་གསུམ་ནས་ཡོངས་སུ་གྲོལ་བར་བྱ་བའི་སེམས་ཅན་གང་ཡང་མི་དམིགས་སོ།
en: Bodhisattva great beings do not apprehend any being at all whom they should liberate from the three realms.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་དེས་ནི་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་ཤེས་སོ། །མཐོང་ངོ་རྟོགས་སོ།
en: If you ask why, it is because they have known, seen, and realized that all phenomena are like a magical display.

source: །སྤྲུལ་པ་ལྟ་བུར་ཤེས་སོ་མཐོང་ངོ་རྟོགས་སོ། །གསོལ་པ།
en: They have known, seen, and realized that they are like a phantom emanation.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཆོས་ཐམས་ཅད་སྒྱུ་མ་ལྟ་བུར་འཚལ་ཅིང་མཐོང་སྟེ། རྟོགས་ལ། སྤྲུལ་པ་ལྟ་བུར་འཚལ་ཅིང་མཐོང་སྟེ། རྟོགས་པ་ལགས་ན། གང་གི་དོན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པ་ལགས།
en: Blessed Lord, if bodhisattva great beings have known, seen, and realized that all phenomena are like a magical display, and known, seen, and realized that they are like a phantom emanation, for what purpose do bodhisattva great beings practice the six perfections?

source: བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་དང་།
en: For what purpose do they practice the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the five extrasensory powers, the thirty-seven factors conducive to enlightenment, and [the fruitional attributes], up to and including the eighteen distinct qualities of the buddhas?

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་བར་ལ་སྤྱོད་པ་ལགས། དེ་ཅིའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་ཀྱི་ལམ་གྱི་བར་ལ་སྤྱོད་པ་ལགས།
en: Why do bodhisattva great beings practice [the paths], up to and including the path of enlightenment?

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བགྱིད་པ་དང་། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བགྱིད་པ་ལགས།
en: Why do they refine the buddhafields and bring beings to maturation?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གལ་ཏེ་སེམས་ཅན་རྣམས་རང་རང་གིས། ཆོས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུར་ཤེས་སུ་ཟིན་ན་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡང་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་བསྐལ་པ་གྲངས་མེད་པར་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་མི་སྤྱོད་དེ།
en: Subhūti,” replied the Blessed One, “if beings of their own accord had known that all phenomena are like a phantom emanation, then bodhisattva great beings would not indeed have engaged in the conduct of a bodhisattva over countless eons for the sake of beings.

source: རབ་འབྱོར་སེམས་ཅན་རྣམས་རང་རང་གིས་ཆོས་ཐམས་ཅད་སྤྲུལ་པ་ལྟ་བུར་མི་ཤེས་པས། དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསྐལ་པ་གྲངས་མེད་པར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་དོ། །སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །སངས་རྒྱས་ཀྱི་ཞིང་ཡང་ཡོངས་སུ་དག་པར་བྱེད་དོ། །རབ་འབྱོར་གྱིས་གསོལ་པ།
en: Subhūti, it is because beings do not know of their own accord that all phenomena are like a phantom emanation that bodhisattva great beings do engage in the six perfections for their sake over countless eons, and they continue to bring beings to maturation, and also refine the buddhafields.”

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་ཆོས་ཐམས་ཅད་རྨི་ལམ་ལྟ་བུ། སྒྲ་བརྙན་ལྟ་བུ། སྨིག་རྒྱུ་ལྟ་བུ། མིག་ཡོར་ལྟ་བུ། སྒྱུ་མ་ལྟ་བུ། སྤྲུལ་པ་ལྟ་བུ་ལགས་ན། བཅོམ་ལྡན་འདས་སེམས་ཅན་རྣམས་ཅི་ལ་གནས་ན།
en: Subhūti then asked, “Blessed Lord, if all phenomena are like a dream, like an echo, like a mirage, like an optical aberration, like a magical display, and like a phantom emanation, what is it, Blessed Lord, on which beings are fixed, and for which bodhisattva great beings practice the perfection of wisdom and cause beings to escape?” “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་རྣམས་གྱེན་དུ་སྐྱོད་པར་བགྱིད། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་སེམས་ཅན་རྣམས་ནི་མིང་དང་མཚན་མ་ཡང་དག་པ་མ་ཡིན་པར་ཡོངས་སུ་བརྟགས་པ་ལ་གནས་པས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་།
en: Subhūti,” replied the Blessed One, “it is because beings are fixed on determining through inauthentic names and signs that bodhisattva great beings practice the perfection of wisdom and cause beings to escape from those names and signs.” “

source: དེ་དག་མིང་དང་མཚན་མ་ལས་གྱེན་དུ་སྐྱོད་དོ། །གསོལ་པ་བཅོམ་ལྡན་འདས་མིང་ནི་གང་ལགས། མཚན་མ་ནི་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལྟ་སྟེ།
en: Blessed Lord, what are names and what are signs?” “

source: མིང་ཞེས་བྱ་བ་འམ། མཚན་མ་ཞེས་བྱ་བ་ནི་གློ་བུར་གྱི་མིང་གིས་སྒྲོ་བཏགས་སོ།
en: Subhūti,” replied the Blessed One, “ ‘names’ and ‘signs’ are adventitious superimpositions by [mere] words.

source: །འདི་ལྟ་སྟེ་མིང་ཞེས་བྱ་བ་འམ། མཚན་མ་ཞེས་བྱ་བ་འམ། གཟུགས་ཞེས་བྱ་བ་འམ། ཚོར་བ་ཞེས་བྱ་བ་འམ། འདུ་ཤེས་ཞེས་བྱ་བ་འམ། འདུ་བྱེད་ཅེས་བྱ་བ་འམ། རྣམ་པར་ཤེས་པ་ཞེས་བྱ་བ་འམ།
en: That is to say, such designations, including ‘names,’ ‘signs,’ ‘physical forms,’ ‘feelings,’ ‘perceptions,’ ‘formative predispositions,’ ‘consciousness.’ ‘

source: བུད་མེད་ཅེས་བྱ་བ་འམ། སྐྱེས་པ་ཞེས་བྱ་བ་འམ། ཁྱེའུ་ཞེས་བྱ་བ་འམ།
en: women,’ ‘men,’ {Ki.

source: བུ་མོ་ཞེས་བྱ་བ་འམ། སེམས་ཅན་དམྱལ་བ་པ་ཞེས་བྱ་བ་འམ། བྱོལ་སོང་གི་སྐྱེ་གནས་པ་ཞེས་བྱ་བ་འམ། གཤིན་རྗེའི་འཇིག་རྟེན་པ་ཞེས་བྱ་བ་འམ། ལྷ་ཞེས་བྱ་བ་འམ། མི་ཞེས་བྱ་བ་འམ། འདུས་བྱས་ཀྱི་ཆོས་ཞེས་བྱ་བ་འམ། འདུས་མ་བྱས་ཀྱི་ཆོས་ཞེས་བྱ་བ་འམ། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཞེས་བྱ་བ་འམ། །ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་ཞེས་བྱ་བ་འམ། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཞེས་བྱ་བ་འམ། དགྲ་བཅོམ་པ་ཉིད་ཅེས་བྱ་བ་འམ།
en: VIII: 77} ‘boys,’ ‘girls,’ ‘denizens of the hells,’ ‘the animal realm,’ ‘the world of Yama,’ ‘gods,’ ‘human beings,’ ‘conditioned phenomena,’ ‘unconditioned phenomena,’ ‘the fruit of entering the stream to nirvāṇa,’ ‘the fruit of being destined for only one more rebirth,’ ‘the fruit of no longer being subject to rebirth,’ ‘arhatship,’ ‘individual enlightenment,’ and ‘complete enlightenment’ have been superimposed by [mere] words that are a magical display.

source: རང་བྱང་ཆུབ་ཅེས་བྱ་བ་འམ། ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཅེས་བྱ་བ་འདི་ནི་སྒྱུ་མའི་མིང་གིས་སྒྲོ་བཏགས་པ་སྟེ། རབ་འབྱོར་མིང་ཐམས་ཅད་ནི་མིང་གི་དོན་གྱིས་བཏགས་པ་སྟེ།
en: Subhūti, all names have been designated by words and concepts.

source: བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་གང་ལ་ཆགས་པར་གྱུར་པའི་འདུས་བྱས་ཐམས་ཅད་ནི་མིང་ཙམ་སྟེ།
en: All conditioned phenomena to which ordinary people form attachments are mere names.

source: དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས། མིང་ཐམས་ཅད་ནི་ཡོངས་སུ་རྟོག་པ་ལས་བྱུང་བ་ཡིན་གྱིས། ཡོངས་སུ་བརྟགས་པ་དངོས་པོ་མེད་པ། ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པ་ལ་ཁྱེད་ཆགས་པར་མ་བྱེད་ཅིག །
en: When bodhisattva great beings practice the perfection of wisdom, they encourage those [ordinary people] through skill in means, saying, ‘All names have originated from imagination, and you should not be attached to imagined nonentities, which are empty of essential nature.

source: ཆོས་ཐམས་ཅད་སྟོང་པ་ལ་མཁས་པ་རྣམས་ནི་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ་ཞེས་བསྐུལ་བ་བྱེད་དེ།
en: The learned do not become fixated on any of these phenomena, which are empty.’

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ལ་ཆོས་སྟོན་པ་ཡིན་ནོ། །རབ་འབྱོར་མཚན་མ་གང་ཞེ་ན།
en: It is in this manner, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they teach the Dharma to beings through skill in means. “

source: གཉིས་པོ་འདི་དག་ནི་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་རྣམས་གང་ལ་ཆགས་པར་གྱུར་པའི་མཚན་མ་སྟེ།
en: Subhūti, if you ask what are signs, the signs to which ordinary people become attached are of two sorts.

source: གཉིས་གང་ཞེ་ན། འདི་ལྟ་སྟེ། གཟུགས་ཀྱི་མཚན་མ་དང་། གཟུགས་མེད་པའི་མཚན་མའོ། །རབ་འབྱོར་གཟུགས་ཀྱི་མཚན་མ་གང་ཞེ་ན།
en: If you ask what these two sorts are, they comprise signs that have form and signs without form.

source: འདས་པ་དང་མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་གཟུགས་རགས་པ་འམ། ཕྲ་བ་འམ་བཟང་བ་འམ་ངན་པ་འམ། རྒྱང་རིང་བ་འམ། ཐག་ཉེ་བ་གང་ཆོས་ཐམས་ཅད་སྐད་ཅིག་མ་ལ་ཀུན་དུ་རྟོག་པས་བཟུང་བ་སྟེ།
en: Subhūti, if you ask what are signs that have form, all momentary phenomena with gross or subtle form, positive or negative, far or near, belonging to the past, future, or present, which are grasped through imagination, are said to be signs that have form.

source: འདི་ནི་གཟུགས་ཀྱི་མཚན་མ་ཞེས་བྱའོ། །རབ་འབྱོར་གཟུགས་མེད་པའི་མཚན་མ་གང་ཞེ་ན། གཟུགས་མེད་པའི་ཆོས་གང་ལ་ཡང་རུང་སྟེ། མཚན་མར་བཟུང་བས་ཡོངས་སུ་བརྟགས་ཤིང་ཉོན་མོངས་པ་སྐྱེ་བར་འགྱུར་བ་སྟེ། འདི་ནི་གཟུགས་མེད་པའི་མཚན་མ་ཞེས་བྱའོ།
en: Subhūti, if you ask what are signs without form, any formless phenomena whatsoever that are imagined by being grasped as signs and then give rise to afflicted mental states are said to be signs without form.

source: །དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་མཚན་མ་དེ་དག་ལས་བཀྲོལ་ཞིང་། མཚན་མ་མེད་པའི་དབྱིངས་སུ་འགོད་ཅིང་རབ་ཏུ་གཞོག་སྟེ། ཅི་ནས་ཀྱང་འདི་ནི་མཚན་མའོ།
en: Therefore, when bodhisattva great beings practice the perfection of wisdom, they will through skill in means release beings from those signs and establish them, so that they come to rest, in the expanse of signlessness.

source: །འདི་ནི་མཚན་མ་མེད་པའོ་ཞེས་བྱ་བ་གཉིས་སུ་མི་ལྟུང་བ་དེ་ལྟར་འགོད་ཅིང་གཞོག་སྟེ།
en: By whatever means they should establish them, letting them come to rest in such a way that they do not fall into duality, thinking, ‘This is a sign’ or ‘That is signlessness.’

source: རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་མཚན་མ་ལས་རྣམ་པར་བཀྲོལ་ཞིང་། མཚན་མ་མེད་པའི་དབྱིངས་སུ་རབ་ཏུ་འགོད་དོ། །གསོལ་པ། གལ་ཏེ་ཆོས་འདི་དག་ཐམས་ཅད་ནི་དེ་ཙམ་དུ་བས་ཏེ།
en: It is in this manner, Subhūti, that when bodhisattva great beings practice the perfection of wisdom, they will through skill in means release beings from those signs and establish them in the expanse of signlessness.” “

source: མིང་དང་མཚན་མར་བས་ལ། བཏགས་པ་ཙམ་དུ་བས་ཏེ། ཡོངས་སུ་བཏགས་པ་ལས་བྱུང་བ་ལགས་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བདག་ཀྱང་དགེ་བའི་ཆོས་ཀྱི་ཁྱད་པར་འཐོབ་ལ། གཞན་ཡང་དགེ་བའི་ཆོས་ཀྱི་ཁྱད་པར་འཐོབ་པ་ལ་གཞོག་ཅིང་། དགེ་བའི་རྩ་བ་དེ་དག་གིས་ས་ནས་ས་ཡོངས་སུ་རྫོགས་པར་བགྱིད་པ་ལགས། སེམས་ཅན་རྣམས་ཐེག་པ་གསུམ་ལ་སྦྱོར་བ་ལགས།
en: If all these phenomena are merely like that, which is to say, they are merely names and signs—mere imputations that originate from imagination—then when bodhisattva great beings practice the perfection of wisdom, how do they attain particular virtuous attributes, and how do they induce others to attain particular virtuous attributes, and engage with them, perfecting the levels, from one to the next, by means of those virtuous attributes, and also induce beings to engage with the three vehicles?” {

source: རབ་འབྱོར་གལ་ཏེ་དངོས་པོ་འམ། དངོས་པོའི་མཚན་མ་ཞིག་ཡོད་ན་ནི། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཁྱད་པར་འཐོབ་པར་ཡང་མི་འགྱུར་ཏེ། གཞན་ཡང་ཁྱད་པར་འཐོབ་པ་ལ་སྦྱོར་བར་མི་འགྱུར་གྱི། འདི་ལྟར་དངོས་པོའི་མཚན་མ་ཡང་མེད། དངོས་པོ་ཡང་མེད་པས་ན།
en: VIII: 78} “Subhūti,” replied the Blessed One, “if there were entities or some indication of an entity, in that case, Subhūti, when bodhisattva great beings practiced the perfection of wisdom, they would not even attain distinction and they would not induce others to attain distinction.

source: རབ་འབྱོར་དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། མཚན་མ་མེད་པའི་ཚུལ་གྱིས། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །མཚན་མ་མེད་པའི་ཚུལ་གྱིས་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: But, on the contrary, it is because there are no entities and no indication of any entity that, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they do perfect the perfection of meditative concentration by way of signlessness, and they do perfect the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity by way of signlessness.

source: །མཚན་མ་མེད་པའི་ཚུལ་གྱིས་བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །མཚན་མ་མེད་པའི་ཚུལ་གྱིས། དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: They do perfect the four meditative concentrations, the four immeasurable attitudes, and the four formless absorptions by way of signlessness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They do perfect the four applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path by way of signlessness.

source: །མཚན་མ་མེད་པའི་ཚུལ་གྱིས་ནང་སྟོང་པ་ཉིད་དང་། ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They do perfect the emptiness of internal phenomena, the emptiness of external phenomena, and the emptiness of external and internal phenomena by way of signlessness.

source: །མཚན་མ་མེད་པའི་ཚུལ་གྱིས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ། །མཚན་མ་མེད་པའི་ཚུལ་གྱིས་རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: They do perfect [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, by way of signlessness.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། འཕགས་པའི་བདེན་པ་བཞི་དང་། རྣམ་པར་ཐར་པའི་སྒོ་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They do perfect the eight aspects of liberation, the nine serial steps of meditative absorption, the four truths of the noble ones, and the gateways of liberation—emptiness, signlessness, and wishlessness—by way of signlessness.

source: །མཚན་མ་མེད་པའི་ཚུལ་གྱིས་མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They do perfect the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways by way of signlessness.

source: །མཚན་མ་མེད་པའི་ཚུལ་གྱིས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་རྫོགས་པར་བྱེད་དོ།
en: They do perfect the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas by way of signlessness.

source: །དེ་དགེ་བའི་ཆོས་དེ་དག་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། མཚན་མ་མེད་པའི་ཚུལ་གྱིས་གཞན་ཡང་དགེ་བའི་ཆོས་དེ་དག་ལ་སྦྱོར་ཏེ།
en: And having perfected these virtuous attributes, they then cause others also to engage in these virtuous attributes by way of signlessness. “

source: རབ་འབྱོར་གལ་ཏེ་ཆུང་ངུ་ན་སྐྲའི་རྩེ་མོའི་ཆ་ཤས་བཞག་པ་ཙམ་གྱིས་ཁྱོན་ཅིག་མཚན་མ་ཡོད་ན་ཡང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་མཚན་མ་མེད་པ། དྲན་པ་མེད་པ། ཡིད་ལ་བྱེད་པ་མེད་པ་དེ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་མི་འགྱུར་ཏེ།
en: Subhūti, if any sign were to exist, even as minutely small as a fraction of a hair-tip, then when bodhisattva great beings practiced the perfection of wisdom, they would not attain consummate buddhahood in which all phenomena are signless, free from recollection and free from attention, nor would they establish beings in uncontaminated phenomena, in the real nature.

source: སེམས་ཅན་རྣམས་ཀྱང་དེ་བཞིན་ཉིད་དང་། ཟག་པ་མེད་པའི་ཆོས་རྣམས་ལ་གཞོག་པར་མི་འགྱུར་རོ། རབ་འབྱོར་ཟག་པ་མེད་པའི་ཆོས་ཐམས་ཅད་ནི་མཚན་མ་མེད་པ། དྲན་པ་མེད་པ་ཡིད་ལ་བྱ་བ་མེད་པ་སྟེ།
en: Subhūti, all uncontaminated phenomena are signless, free from recollection, and free from attention.

source: རབ་འབྱོར་དེ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཟག་པ་མེད་པའི་ཆོས་རྣམས་ཀྱིས་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་བྱེད་དོ། །གསོལ་པ།
en: Therefore, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they continue to act for the sake of all beings by means of uncontaminated phenomena.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་ཆོས་ཐམས་ཅད་མཚན་མ་མ་མཆིས་ཤིང་། དྲན་པ་མ་མཆིས་ཏེ། ཡིད་ལ་བགྱི་བ་མ་མཆིས་ན། བཅོམ་ལྡན་འདས་འདི་ལྟར་འདི་དག་ནི་དགེ་བའི་ཆོས་སོ།
en: Blessed Lord, if all phenomena are signless, free from recollection, and free from attention, in that case, Blessed Lord, how are designations applied, such as, ‘These are virtuous attributes.

source: །འདི་དག་ནི་མི་དགེ་བའི་ཆོས་སོ།
en: These are nonvirtuous attributes.

source: །འདི་དག་ནི་འཇིག་རྟེན་པའི་ཆོས་སོ།
en: These are mundane attributes.

source: །འདི་དག་ནི་འཇིག་རྟེན་ལས་འདས་པའི་ཆོས་སོ།
en: These are supramundane attributes.

source: །འདི་དག་ནི་ཟག་པ་དང་བཅས་པའི་ཆོས་སོ།
en: These are contaminated attributes.

source: །འདི་དག་ནི་ཟག་པ་མེད་པའི་ཆོས་སོ།
en: These are uncontaminated attributes.

source: །འདི་དག་ནི་འདུས་བྱས་ཀྱི་ཆོས་སོ།
en: These are conditioned attributes.

source: །འདི་དག་ནི་འདུས་མ་བྱས་ཀྱི་ཆོས་སོ།
en: These are unconditioned attributes.

source: །འདི་དག་ནི་ཐུན་མོང་གི་ཆོས་སོ།
en: These are common attributes.

source: །འདི་དག་ནི་ཐུན་མོང་མ་ཡིན་པའི་ཆོས་སོ།
en: These are uncommon attributes.

source: །འདི་དག་ནི་ཉན་ཐོས་ཀྱི་ཆོས་སོ།
en: These are the attributes of śrāvakas.

source: །འདི་དག་ནི་རང་སངས་རྒྱས་ཀྱི་ཆོས་སོ།
en: These are the attributes of pratyekabuddhas.

source: །འདི་དག་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་སོ།
en: These are the attributes of bodhisattvas.

source: །འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་སོ་ཞེས་ཇི་ལྟར་བགྲང་བར་བགྱི།
en: These are the attributes of buddhas’?” {

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། མཚན་མ་མེད་པ་ཡང་གཞན་ལ་ཉན་ཐོས་ཀྱི་ཆོས་རྣམས་ཀྱང་གཞན་ནམ།
en: VIII: 79} “Subhūti, do you think that signlessness is one thing and the attributes of the śrāvakas are another?”

source: རབ་འབྱོར་དེ་ཇི་སྙམ་དུ་སེམས། མཚན་མ་མེད་པ་ཡང་གཞན་ལ། རང་སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་གཞན་ནམ། མཚན་མ་མེད་པ་ཡང་གཞན་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཆོས་རྣམས་ཀྱང་གཞན་ནམ། མཚན་མ་མེད་པ་ཡང་གཞན་ལ། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཀྱང་གཞན་ནམ།
en: Subhūti, do you think that signlessness is one thing and the attributes of the pratyekabuddhas are another, that signlessness is one thing and that the attributes of the bodhisattvas are also another, and that signlessness is one thing and that the attributes of the buddhas are also another?”
